interface IParams {
    phone: string | number;
    variant: '+79999999999' | '79999999999' | '+7(999)999-99-99' | '89999999999' | '+7 999 999 99-99' | '+7(999) 999 99 99';
}
/**
 * Форматирует телефонный номер согласно указанному варианту.
 *
 * @param phone Телефонный номер (строка или число).
 * @param variant Вариант форматирования: '+79999999999', '79999999999', '+7(999)999-99-99', '89999999999', '+7 999 999 99-99'.
 * @returns Отформатированный телефонный номер или undefined, если phone не передан.
 * @example
 * formatPhone('9155555555', '+79999999999') // '+79155555555'
 * formatPhone('9155555555', '+7(999)999-99-99') // '+7(915)555-55-55'
 * formatPhone('9155555555', '89999999999') // '89155555555'
 * formatPhone('9155555555', '+7 999 999 99-99') // '+7 915 555 55-55'
 */
declare function formatPhone(phone: string | number, variant: IParams['variant']): string | number;

export { formatPhone };
